Sources/interTwoPhaseCentralFoam/tutorial/MovingContact/constant/reactions
species
(
    gas
);

reactions
{
}
