Sources/interTwoPhaseCentralFoam/tutorial/MovingContact/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 300
    volScalarFieldValue p 1e+5
    volVectorFieldValue U ( 100 0 0 )
    volScalarFieldValue alpha.liquid 0
);

regions
(
    boxToCell
    {
        box ( 5 -1 -1 ) ( 10  1  1 );
        fieldValues
        (
            volScalarFieldValue alpha.liquid 1
        );
    }
);


// ************************************************************************* //
